cases/nozz_10/constant/chem_30_reactions
elements        1(AR);

species         30(AR AR2 AR3 AR4 AR5 AR6 AR7 AR8 AR9 AR10 AR11 AR12 AR13 AR14 AR15 AR16 AR17 AR18 AR19 AR20 AR21 AR22 AR23 AR24 AR25 AR26 AR27 AR28 AR29 AR30);

reactions
{
    un-named-reaction-0
    {
        type            irreversibleArrheniusReaction;
        reaction        "3AR = AR2 + AR";
        A               1.39833e11;
        beta            -0.504;
        Ta              0;
    }
    un-named-reaction-1
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR2 + AR = AR3";
        A               2.25E+09;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-2
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR3 + AR = AR4";
        A               2.92E+09;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-3
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR4 + AR = AR5";
        A               4.06E+09;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-4
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR5 + AR = AR6";
        A               6.77E+09;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-5
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR6 + AR = AR7";
        A               1.32E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-6
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR7 + AR = AR8";
        A               2.27E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-7
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR8 + AR = AR9";
        A               3.15E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-8
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR9 + AR = AR10";
        A               3.63E+10;
        beta            0.5;
        Ta              0;
    }
    
//**********************************  10-19 forward  ************************

    un-named-reaction-9
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR10 + AR = AR11";
        A               3.98E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-10
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR11 + AR = AR12";
        A               4.26E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-11
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR12 + AR = AR13";
        A               4.49E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-12
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR13 + AR = AR14";
        A               4.70E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-13
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR14 + AR = AR15";
        A               4.88E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-14
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR15 + AR = AR16";
        A               5.04E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-15
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR16 + AR = AR17";
        A               5.19E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-16
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR17 + AR = AR18";
        A               5.34E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-17
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR18 + AR = AR19";
        A               5.47E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-18
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR19 + AR = AR20";
        A               5.60E+10;
        beta            0.5;
        Ta              0;
    }
    
//**********************************  20-29 forward  ************************
    
    un-named-reaction-19
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR20 + AR = AR21";
        A               5.73E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-20
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR21 + AR = AR22";
        A               5.85E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-21
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR22 + AR = AR23";
        A               5.96E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-22
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR23 + AR = AR24";
        A               6.07E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-23
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR24 + AR = AR25";
        A               6.18E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-24
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR25 + AR = AR26";
        A               6.29E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-25
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR26 + AR = AR27";
        A               6.39E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-26
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR27 + AR = AR28";
        A               6.49E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-27
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR28 + AR = AR29";
        A               6.59E+10;
        beta            0.5;
        Ta              0;
    }
    un-named-reaction-28
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR29 + AR = AR30";
        A               6.68E+10;
        beta            0.5;
        Ta              0;
    }
     
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
//**********************************  1-9 reverse  ************************ 
    
    un-named-reaction-29
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR2 + AR = 3AR";
        A               7.57E+04;
        beta            3.68E-01;
        Ta              143.41;
    }
    un-named-reaction-30
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR3 = AR2 + AR";
        A               1.22E+09;
        beta            1.37;
        Ta              143.41;
    }
    un-named-reaction-31
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR4 = AR3 + AR";
        A               1.58E+09;
        beta            1.37;
        Ta              143.41;
    }
    un-named-reaction-32
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR5 = AR4 + AR";
        A               2.20E+09;
        beta            1.37;
        Ta              143.41;
    }
    un-named-reaction-33
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR6 = AR5 + AR";
        A               3.67E+09;
        beta            1.37;
        Ta              143.41;
    }
    un-named-reaction-34
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR7 = AR6 + AR";
        A               7.14E+09;
        beta            1.37;
        Ta              143.41;
    }
    un-named-reaction-35
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR8 = AR7 + AR";
        A               1.23E+10;
        beta            1.37;
        Ta              143.41;
    }
    un-named-reaction-36
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR9 = AR8 + AR";
        A               1.70E+10;
        beta            1.37;
        Ta              143.41;
    }
    un-named-reaction-37
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR10 = AR9 + AR";
        A               1.97E+10;
        beta            1.37;
        Ta              143.41;
    }
    
//**********************************  10-19 reverse  ************************ 
    
    un-named-reaction-38
    {
        type            irreversibleArrheniusReaction;
        reaction        "AR11 = AR10 + AR";
        A               2.16E+10;
        beta            1.37;
        Ta              143.41;
    }
    un-named-reaction-39
    {
        type            irreversibleCondensReaction;
        reaction        "AR12 = AR11 + AR";
        A               7.52E+19;
        beta            -3.05E+00;
        Ta              551.9995;
        B		0.0170;
    }
    un-named-reaction-40
    {
        type            irreversibleCondensReaction;
        reaction        "AR13 = AR12 + AR";
        A               5.52E+20;
        beta            -3.442;
        Ta              588.178;
        B		0.0185;
    }
    un-named-reaction-41
    {
        type            irreversibleCondensReaction;
        reaction        "AR14 = AR13 + AR";
        A               3.26E+21;
        beta            -3.792;
        Ta              620.481;
        B		0.0199;
    }
    un-named-reaction-42
    {
        type            irreversibleCondensReaction;
        reaction        "AR15 = AR14 + AR";
        A               1.61E+22;
        beta            -4.106;
        Ta              649.504;
        B		0.0211;
    }
    un-named-reaction-43
    {
        type            irreversibleCondensReaction;
        reaction        "AR16 = AR15 + AR";
        A               6.77E+22;
        beta            -4.390;
        Ta              675.736;
        B		0.0222;
    }
    un-named-reaction-44
    {
        type            irreversibleCondensReaction;
        reaction        "AR17 = AR16 + AR";
        A               2.50E+23;
        beta            -4.648;
        Ta              699.580;
        B		0.0232;
    }
    un-named-reaction-45
    {
        type            irreversibleCondensReaction;
        reaction        "AR18 = AR17 + AR";
        A               8.28E+23;
        beta            -4.884;
        Ta              721.365;
        B		0.0241;
    }
    un-named-reaction-46
    {
        type            irreversibleCondensReaction;
        reaction        "AR19 = AR18 + AR";
        A               2.48E+24;
        beta            -5.101;
        Ta              741.363;
        B		0.0249;
    }
    un-named-reaction-47
    {
        type            irreversibleCondensReaction;
        reaction        "AR20 = AR19 + AR";
        A               6.82E+24;
        beta            -5.300;
        Ta              759.802;
        B		0.0257;
    }
    
//**********************************  20-29 reverse  ************************ 

    un-named-reaction-48
    {
        type            irreversibleCondensReaction;
        reaction        "AR11 = AR10 + AR";
        A               1.74E+25;
        beta            -5.485;
        Ta              776.870;
        B		0.0264;
    }
    un-named-reaction-49
    {
        type            irreversibleCondensReaction;
        reaction        "AR12 = AR11 + AR";
        A               4.16E+25;
        beta            -5.657;
        Ta              792.727;
        B		0.0270;
    }
    un-named-reaction-50
    {
        type            irreversibleCondensReaction;
        reaction        "AR13 = AR12 + AR";
        A               9.37E+25;
        beta            -5.817;
        Ta              807.508;
        B		0.0277;
    }
    un-named-reaction-51
    {
        type            irreversibleCondensReaction;
        reaction        "AR14 = AR13 + AR";
        A               2.00E+26;
        beta            -5.966;
        Ta              821.330;
        B		0.0282;
    }
    un-named-reaction-52
    {
        type            irreversibleCondensReaction;
        reaction        "AR15 = AR14 + AR";
        A               4.09E+26;
        beta            -6.106;
        Ta              834.291;
        B		0.0288;
    }
    un-named-reaction-53
    {
        type            irreversibleCondensReaction;
        reaction        "AR16 = AR15 + AR";
        A               7.99E+26;
        beta            -6.238;
        Ta              846.477;
        B		0.0293;
    }
    un-named-reaction-54
    {
        type            irreversibleCondensReaction;
        reaction        "AR17 = AR16 + AR";
        A               1.50E+27;
        beta            -6.363;
        Ta              857.962;
        B		0.0298;
    }
    un-named-reaction-55
    {
        type            irreversibleCondensReaction;
        reaction        "AR18 = AR17 + AR";
        A               2.73E+27;
        beta            -6.480;
        Ta              868.810;
        B		0.0302;
    }
    un-named-reaction-56
    {
        type            irreversibleCondensReaction;
        reaction        "AR19 = AR18 + AR";
        A               4.81E+27;
        beta            -6.591;
        Ta              879.080;
        B		0.0306;
    }
    un-named-reaction-57
    {
        type            irreversibleCondensReaction;
        reaction        "AR20 = AR19 + AR";
        A               8.22E+27;
        beta            -6.697;
        Ta              888.820;
        B		0.0310;
    }
}
