cases/nozz_10/constant/chem_empty
elements        1(AR);

species         1(AR);

reactions
{
}
