cases/nozz_10/constant/thermo_Ar
AR
{
    specie
    {
        molWeight       40.0;
    }
    thermodynamics
    {
        Tlow            1;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 2.5 0.0 0.0 0.0 0.0 -7.45375000E+02 4.37967491E+00 );
        lowCpCoeffs     ( 2.5 0.00 0.00 0.00 0.00 -7.45375000E+02 4.37967491E+00);
    }
    transport
    {
        As              2.25e-07;
        Ts              0.81;
    }
    elements
    {
        AR               1;
    }
}


