cases/nozz_10/constant/thermo_Ar10
AR
{
    specie
    {
        molWeight       40.0;
    }
    thermodynamics
    {
        Tlow            1;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 2.5 0.0 0.0 0.0 0.0 -7.45375000E+02 4.37967491E+00 );
        lowCpCoeffs     ( 2.5 0.00 0.00 0.00 0.00 -7.45375000E+02 4.37967491E+00);
    }
    transport
    {
        As              2.25e-07;
        Ts              0.81;
    }
    elements
    {
        AR               1;
    }
      
}

AR2
{
    specie
    {
        molWeight       80.0;
    }
    thermodynamics
    {
        Tlow            1;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 2.75E+00 0.0 0.0 0.0 0.0 -7.45375000E+02 4.37967491E+00 );
        lowCpCoeffs     ( 2.75E+00 0.00 0.00 0.00 0.00 -7.45375000E+02 4.37967491E+00);
    }
    transport
    {
        As              2.25e-07;
        Ts              0.81;
    }
    elements
    {
        AR               2;
    }
      
}

AR3
{
    specie
    {
        molWeight       120.0;
    }
    thermodynamics
    {
        Tlow            1;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.00 0.0 0.0 0.0 0.0 -7.45375000E+02 4.37967491E+00 );
        lowCpCoeffs     ( 3.00 0.00 0.00 0.00 0.00 -7.45375000E+02 4.37967491E+00);
    }
    transport
    {
        As              2.25e-07;
        Ts              0.81;
    }
    elements
    {
        AR               3;
    }
      
}

AR4
{
    specie
    {
        molWeight       160.0;
    }
    thermodynamics
    {
        Tlow            1;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.25 0.0 0.0 0.0 0.0 -7.45375000E+02 4.37967491E+00 );
        lowCpCoeffs     ( 3.25 0.00 0.00 0.00 0.00 -7.45375000E+02 4.37967491E+00);
    }
    transport
    {
        As              2.25e-07;
        Ts              0.81;
    }
    elements
    {
        AR               4;
    }
      
}

AR5
{
    specie
    {
        molWeight       200.0;
    }
    thermodynamics
    {
        Tlow            1;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.4 0.0 0.0 0.0 0.0 -7.45375000E+02 4.37967491E+00 );
        lowCpCoeffs     ( 3.4 0.00 0.00 0.00 0.00 -7.45375000E+02 4.37967491E+00);
    }
    transport
    {
        As              2.25e-07;
        Ts              0.81;
    }
    elements
    {
        AR               5;
    }
      
}

AR6
{
    specie
    {
        molWeight       240.0;
    }
    thermodynamics
    {
        Tlow            1;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.49 0.0 0.0 0.0 0.0 -7.45375000E+02 4.37967491E+00 );
        lowCpCoeffs     ( 3.49 0.00 0.00 0.00 0.00 -7.45375000E+02 4.37967491E+00);
    }
    transport
    {
        As              2.25e-07;
        Ts              0.81;
    }
    elements
    {
        AR               6;
    }
      
}

AR7
{
    specie
    {
        molWeight       280.0;
    }
    thermodynamics
    {
        Tlow            1;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.57 0.0 0.0 0.0 0.0 -7.45375000E+02 4.37967491E+00 );
        lowCpCoeffs     ( 3.57 0.00 0.00 0.00 0.00 -7.45375000E+02 4.37967491E+00);
    }
    transport
    {
        As              2.25e-07;
        Ts              0.81;
    }
    elements
    {
        AR               7;
    }
      
}

AR8
{
    specie
    {
        molWeight       320.0;
    }
    thermodynamics
    {
        Tlow            1;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.62 0.0 0.0 0.0 0.0 -7.45375000E+02 4.37967491E+00 );
        lowCpCoeffs     ( 3.62 0.00 0.00 0.00 0.00 -7.45375000E+02 4.37967491E+00);
    }
    transport
    {
        As              2.25e-07;
        Ts              0.81;
    }
    elements
    {
        AR               8;
    }
      
}

AR9
{
    specie
    {
        molWeight       360.0;
    }
    thermodynamics
    {
        Tlow            1;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.67E+00 0.0 0.0 0.0 0.0 -7.45375000E+02 4.37967491E+00 );
        lowCpCoeffs     ( 3.67E+00 0.00 0.00 0.00 0.00 -7.45375000E+02 4.37967491E+00);
    }
    transport
    {
        As              2.25e-07;
        Ts              0.81;
    }
    elements
    {
        AR               9;
    }
      
}

AR10
{
    specie
    {
        molWeight       400.0;
    }
    thermodynamics
    {
        Tlow            1;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.7 0.0 0.0 0.0 0.0 -7.45375000E+02 4.37967491E+00 );
        lowCpCoeffs     ( 3.7 0.00 0.00 0.00 0.00 -7.45375000E+02 4.37967491E+00);
    }
    transport
    {
        As              2.25e-07;
        Ts              0.81;
    }
    elements
    {
        AR               10;
    }
      
}

