cases/nozz_10/constant/thermo_j9
N2
{
    specie
    {
        molWeight       28.0134;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           20000;
        Tcommon         1000;
        Tcommon2        6000;
        highCpCoeffs    ( 8.310139160E+08 -6.420733540E+05 2.020264635E+02 -3.065092046E-02 2.486903333E-06 -9.705954110E-11 1.437538881E-15 4.938707040E+06 -1.672099740E+03 );
        middleCpCoeffs    ( 5.877124060E+05 -2.239249073E+03 6.066949220E+00 -6.139685500E-04 1.491806679E-07 -1.923105485E-11 1.061954386E-15 1.283210415E+04 -1.586640027E+01 );
        lowCpCoeffs     ( 2.210371497E+04 -3.818461820E+02 6.082738360 -8.530914410E-03 1.384646189E-05 -9.625793620E-09 2.519705809E-12 7.108460860E+02 -1.076003744E+01 );
    }
    transport
    {
        As              1.458e-6;
        Ts              110.4;
    }
    elements
    {
        N               2;
    }
}

N
{
    specie
    {
        molWeight       14.0067;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           20000;
        Tcommon         1000;
        Tcommon2        6000;
        highCpCoeffs    ( 5.475181050E+08 -3.107574980E+05 6.916782740E+01 -6.847988130E-03 3.827572400E-07 -1.098367709E-11 1.277986024E-16 2.550585618E+06 -5.848769710E+02 );
        middleCpCoeffs    ( 8.876501380E+04 -1.071231500E+02 2.362188287E+00 2.916720081E-04 -1.729515100E-07 4.012657880E-11 -2.677227571E-15 5.697351330E+04 4.865235790E+00 );
        lowCpCoeffs     ( 0.000000000E+00 0.000000000E+00 2.500000000E+00 0.000000000E+00 0.000000000E+00 0.000000000E+00 0.000000000E+00 5.610463780E+04 4.193909320E+00 );
    }
    transport
    {
        As              1.458e-6;
        Ts              110.4;
    }
    elements
    {
        N               1;
    }
}

E
{
    specie
    {
        molWeight       0.000545;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           20000;
        Tcommon         1000;
        Tcommon2        6000;
        highCpCoeffs    ( 0.000000000E+00 0.000000000E+00 2.500000000E+00 0.000000000E+00 0.000000000E+00 0.000000000E+00 0.000000000E+00 -7.453750000E+02 -1.172081224E+01 );
        middleCpCoeffs    ( 0.000000000E+00 0.000000000E+00 2.500000000E+00 0.000000000E+00 0.000000000E+00 0.000000000E+00 0.000000000E+00 -7.453750000E+02 -1.172081224E+01 );
        lowCpCoeffs     ( 0.000000000E+00 0.000000000E+00 2.500000000E+00 0.000000000E+00 0.000000000E+00 0.000000000E+00 0.000000000E+00 -7.453750000E+02 -1.172081224E+01 );
    }
    transport
    {
        As              1.458e-6;
        Ts              110.4;
    }
    elements
    {
        e               1;
    }
}

N2p
{
    specie
    {
        molWeight       28.012855;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           20000;
        Tcommon         1000;
        Tcommon2        6000;
        highCpCoeffs    ( -3.712829770E+08 3.139287234E+05 -9.603518050E+01 1.571193286E-02 -1.175065525E-06 4.144441230E-11 -5.621893090E-16 -2.217361867E+06 8.436270947E+02 );
        middleCpCoeffs    ( -2.845599002E+06 7.058893030E+03 -2.884886385E+00 3.068677059E-03 -4.361652310E-07 2.102514545E-11 5.411996470E-16 1.340388483E+05 5.090897022E+01 );
        lowCpCoeffs     ( -3.474047470E+04 2.696222703E+02 3.164916370E+00 -2.132239781E-03 6.730476400E-06 -5.637304970E-09 1.621756000E-12 1.790004424E+05 6.832974166E+00 );
    }
    transport
    {
        As              1.458e-6;
        Ts              110.4;
    }
    elements
    {
        N               2;
        e               -1;
    }
}

Np
{
    specie
    {
        molWeight       14.006155;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           20000;
        Tcommon         1000;
        Tcommon2        6000;
        highCpCoeffs    ( 1.646092148E+07 -1.113165218E+04 4.976986640E+00 -2.005393583E-04 1.022481356E-08 -2.691430863E-13 3.539931593E-18 3.136284696E+05 -1.706646380E+01 );
        middleCpCoeffs    ( 2.904970374E+05 -8.557908610E+02 3.477389290E+00 -5.288267190E-04 1.352350307E-07 -1.389834122E-11 5.046166279E-16 2.310809984E+05 -1.994146545E+00 );
        lowCpCoeffs     ( 5.237079210E+03 2.299958315E+00 2.487488821E+00 2.737490756E-05 -3.134447576E-08 1.850111332E-11 -4.447350984E-15 2.256284738E+05 5.076830786E+00 );
    }
    transport
    {
        As              1.458e-6;
        Ts              110.4;
    }
    elements
    {
        N               1;
        e               -1;
    }
}
