cases/nozz_10/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (317.5 0 0);

boundaryField
{
/*
    wall_end
    {
	type		zeroGradient;
    }
    */
    wall_nozz
    {
	type		fixedValue;
        value 		uniform (0 0 0);
    }
    outlet
    {
	type		zeroGradient;
    }
    
    inlet
    {
	type		fixedValue;
        value 		uniform (317.5 0 0);
    }
    
    front
    {
	type 		wedge;
    }
    back
    {
	type 		wedge;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //

