cases/nozz_10/0.orig/AR
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      AR;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
	inlet
	{
	    type            fixedValue;
	    value           uniform 1.0;
	}
	wall_nozz
	{
	    type            zeroGradient;
	}
/*	wall_end
	{
	    type            zeroGradient;
	}
*/
	front
        {
            type            wedge;
        }
        back
        {
            type            wedge;
        }
	outlet
	{
	    type	    zeroGradient;
//	    type            inletOutlet;
//	    inletValue      uniform 0.0;
//	    value           uniform 0.0;
	}
	//defaultFaces
	//{
	//    type            empty;
	//}
}


// ************************************************************************* //
