cases/nozz_10/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    wall_nozz
    {
        type    wall;
    }
    wall_end
    {
        type    wall;
    }
//    symmetry
//    {
//	type	symmetryPlane;
//    }
    front
    {
	type	wedge;
    }
    back
    {
	type	wedge;
    }
}

// ************************************************************************* //
